{"format": "graph-model", "generatedBy": "2.16.1", "convertedBy": "TensorFlow.js Converter v4.19.0", "signature": {"inputs": {"keras_tensor_1034": {"name": "keras_tensor_1034:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "6"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_10_1/dense_51_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}, {"size": "15"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_10_1/dense_51_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "15"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10_1/batch_normalization_19_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "15"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10_1/batch_normalization_19_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "15"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10_1/dense_52_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "15"}, {"size": "15"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_10_1/dense_52_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "15"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_10_1/batch_normalization_20_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "15"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10_1/batch_normalization_20_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "15"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10_1/dense_53_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "15"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_10_1/dense_53_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "keras_tensor_1034", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "6"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10_1/dense_51_1/Add", "op": "_FusedMatMul", "input": ["keras_tensor_1034", "StatefulPartitionedCall/sequential_10_1/dense_51_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_10_1/dense_51_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_10_1/batch_normalization_19_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_10_1/dense_51_1/Add", "StatefulPartitionedCall/sequential_10_1/batch_normalization_19_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10_1/batch_normalization_19_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_10_1/batch_normalization_19_1/batchnorm/mul_1", "StatefulPartitionedCall/sequential_10_1/batch_normalization_19_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10_1/activation_31_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_10_1/batch_normalization_19_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10_1/dense_52_1/Add", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_10_1/activation_31_1/Relu", "StatefulPartitionedCall/sequential_10_1/dense_52_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_10_1/dense_52_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_10_1/batch_normalization_20_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_10_1/dense_52_1/Add", "StatefulPartitionedCall/sequential_10_1/batch_normalization_20_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10_1/batch_normalization_20_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_10_1/batch_normalization_20_1/batchnorm/mul_1", "StatefulPartitionedCall/sequential_10_1/batch_normalization_20_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10_1/activation_32_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_10_1/batch_normalization_20_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10_1/dense_53_1/Add", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_10_1/activation_32_1/Relu", "StatefulPartitionedCall/sequential_10_1/dense_53_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_10_1/dense_53_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.2}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/sequential_10_1/dense_53_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_10_1/dense_53_1/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_10_1/dense_53_1/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1766}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_10_1/dense_51_1/Cast/ReadVariableOp", "shape": [6, 15], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_10_1/dense_51_1/Add/ReadVariableOp", "shape": [15], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_10_1/batch_normalization_19_1/batchnorm/mul", "shape": [15], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_10_1/batch_normalization_19_1/batchnorm/sub", "shape": [15], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_10_1/dense_52_1/Cast/ReadVariableOp", "shape": [15, 15], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_10_1/dense_52_1/Add/ReadVariableOp", "shape": [15], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_10_1/batch_normalization_20_1/batchnorm/mul", "shape": [15], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_10_1/batch_normalization_20_1/batchnorm/sub", "shape": [15], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_10_1/dense_53_1/Cast/ReadVariableOp", "shape": [15, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_10_1/dense_53_1/Add/ReadVariableOp", "shape": [1], "dtype": "float32"}]}]}